zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_hash.h
  void (* DgstCpltCallback)(struct __HASH_HandleTypeDef *hhash);       /*!< HASH digest computation completion callback */

  void (* ErrorCallback)(struct __HASH_HandleTypeDef *hhash);          /*!< HASH error callback */

  void (* MspInitCallback)(struct __HASH_HandleTypeDef *hhash);        /*!< HASH Msp Init callback */

  void (* MspDeInitCallback)(struct __HASH_HandleTypeDef *hhash);      /*!< HASH Msp DeInit callback */

#endif /* (USE_HAL_HASH_REGISTER_CALLBACKS) */
} HASH_HandleTypeDef;

#if (USE_HAL_HASH_REGISTER_CALLBACKS == 1U)
/**
  * @brief  HAL HASH Callback pointer definition
  */
typedef  void (*pHASH_CallbackTypeDef)(HASH_HandleTypeDef *hhash);  /*!< pointer to a HASH common callback functions */
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup HASH_Exported_Constants  HASH Exported Constants
  * @{
  */

/** @defgroup HASH_Algo_Selection   HASH algorithm selection
  * @{
  */


#define HASH_ALGOSELECTION_SHA1            ((0x0U * HASH_CR_ALGO_1) + (0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA224          ((0x1U * HASH_CR_ALGO_1) + (0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA256          ((0x1U * HASH_CR_ALGO_1) + (0x1U * HASH_CR_ALGO_0))

#define HASH_ALGOSELECTION_SHA384          ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x0U * HASH_CR_ALGO_1)\
                                            + (0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA512_224      ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x0U * HASH_CR_ALGO_1)\
                                            + (0x1U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA512_256      ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x1U * HASH_CR_ALGO_1)\
                                            + (0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA512          ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x1U * HASH_CR_ALGO_1)\
                                            + (0x1U * HASH_CR_ALGO_0))

#define HASH_ALGOSELECTION_SHA3_224        ((0x0U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x0U * HASH_CR_ALGO_1)\
                                            +(0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA3_256        ((0x0U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x0U * HASH_CR_ALGO_1)\
                                            + (0x1U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA3_384        ((0x0U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x1U * HASH_CR_ALGO_1)\
                                            + (0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHA3_512        ((0x0U * HASH_CR_ALGO_3)\
                                            + (0x1U * HASH_CR_ALGO_2) + (0x1U * HASH_CR_ALGO_1)\
                                            + (0x1U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHAKE_128       ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x0U * HASH_CR_ALGO_2) + (0x0U * HASH_CR_ALGO_1)\
                                            + (0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_SHAKE_256       ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x0U * HASH_CR_ALGO_2) + (0x0U * HASH_CR_ALGO_1)\
                                            + (0x1U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_RAWSHAKE_128    ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x0U * HASH_CR_ALGO_2) + (0x1U * HASH_CR_ALGO_1)\
                                            + (0x0U * HASH_CR_ALGO_0))
#define HASH_ALGOSELECTION_RAWSHAKE_256    ((0x1U * HASH_CR_ALGO_3)\
                                            + (0x0U * HASH_CR_ALGO_2) + (0x1U * HASH_CR_ALGO_1)\
                                            + (0x1U * HASH_CR_ALGO_0))

/**
  * @}
  */

/** @defgroup HASH_Algorithm_Mode   HASH algorithm mode
  * @{
  */
#define HASH_ALGOMODE_HASH         0x00000000U /*!< Algorithm is HASH */
#define HASH_ALGOMODE_HMAC         HASH_CR_MODE           /*!< Algorithm is HMAC */
/**
  * @}
  */

/** @defgroup HASH_Data_Type      HASH input data type
  * @{
  */
#define HASH_DATATYPE_32B          0x00000000U /*!< 32-bit data. No swapping                     */
#define HASH_DATATYPE_16B          HASH_CR_DATATYPE_0 /*!< 16-bit data. Each half word is swapped       */
#define HASH_DATATYPE_8B           HASH_CR_DATATYPE_1 /*!< 8-bit data. All bytes are swapped            */
#define HASH_DATATYPE_1B           HASH_CR_DATATYPE   /*!< 1-bit data. In the word all bits are swapped */
/**
  * @}
  */

/** @defgroup HASH_HMAC_Long_key_only_for_HMAC_mode   HMAC key length type
  * @{
  */
#define HASH_HMAC_KEYTYPE_SHORTKEY      0x00000000U /*!< HMAC Key size is <= 64 bytes */
#define HASH_HMAC_KEYTYPE_LONGKEY       HASH_CR_LKEY           /*!< HMAC Key size is > 64 bytes  */
/**
  * @}
  */

/** @defgroup HASH_Number_Of_CSR_Registers HASH Number of Context Swap Registers
  * @{
  */

#define HASH_NUMBER_OF_CSR_REGISTERS             103U     /*!< Number of Context Swap Registers */

/**
  * @}
  */

/** @defgroup HASH_FULLSWAPCONTEXT_BUFFER_WSIZE Size in word of the full context swap buffer
  * @{
  */

#define HASH_FULLSWAPCONTEXT_BUFFER_WSIZE             (4 + HASH_NUMBER_OF_CSR_REGISTERS)  /*!< Save/Restore HASH_IMR + HASH_STR + HASH_CR + HASH_SHA3CFGR + HASH_CSRx */

/**
  * @}
  */

/** @defgroup HASH_flags_definition  HASH flags definitions
  * @{
  */
#define HASH_FLAG_DINIS            HASH_SR_DINIS  /*!< 16 locations are free in the DIN : a new block can be entered in the Peripheral */
#define HASH_FLAG_DCIS             HASH_SR_DCIS   /*!< Digest calculation complete                                                     */
#define HASH_FLAG_DMAS             HASH_SR_DMAS   /*!< DMA interface is enabled (DMAE=1) or a transfer is ongoing                      */
#define HASH_FLAG_BUSY             HASH_SR_BUSY   /*!< The hash core is Busy, processing a block of data                               */
#define HASH_FLAG_DINNE            HASH_CR_DINNE  /*!< DIN not empty : the input buffer contains at least one word of data             */

/**
  * @}
  */

/** @defgroup HASH_interrupts_definition   HASH interrupts definitions
  * @{
  */
#define HASH_IT_DINI               HASH_IMR_DINIE  /*!< A new block can be entered into the input buffer (DIN) */
#define HASH_IT_DCI                HASH_IMR_DCIE   /*!< Digest calculation complete                            */

/**
  * @}
  */

/** @defgroup HASH_Error_Definition   HASH Error Definition
  * @{
  */
#define  HAL_HASH_ERROR_NONE             0x00000000U   /*!< No error                */
#define  HAL_HASH_ERROR_IT               0x00000001U   /*!< IT-based process error  */
#define  HAL_HASH_ERROR_DMA              0x00000002U   /*!< DMA-based process error */
#if (USE_HAL_HASH_REGISTER_CALLBACKS == 1U)
#define  HAL_HASH_ERROR_INVALID_CALLBACK 0x00000004U   /*!< Invalid Callback error  */
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup HASH_Exported_Macros HASH Exported Macros
  * @{
  */

/** @brief  Check whether or not the specified HASH flag is set.
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg @ref HASH_FLAG_DINIS A new block can be entered into the input buffer.
  *            @arg @ref HASH_FLAG_DCIS Digest calculation complete.
  *            @arg @ref HASH_FLAG_DMAS DMA interface is enabled (DMAE=1) or a transfer is ongoing.
  *            @arg @ref HASH_FLAG_BUSY The hash core is Busy : processing a block of data.
  *            @arg @ref HASH_FLAG_DINNE DIN not empty : the input buffer contains at least one word of data.
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_HASH_GET_FLAG(__FLAG__)  (((__FLAG__) > 8U)  ?                    \
                                        ((HASH->CR & (__FLAG__)) == (__FLAG__)) :\
                                        ((HASH->SR & (__FLAG__)) == (__FLAG__)) )


